#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.argocd.helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version    = "v3.2.1"
              - chart          = "argo-cd"
              - first_deployed = 1765718701
              - last_deployed  = 1765775518
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file `server.ingress.enabled` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 3
              - values         = jsonencode(
                    {
                      - applicationSet = {
                          - enabled  = true
                          - replicas = 1
                        }
                      - configs        = {
                          - cm     = {
                              - "admin.enabled" = "true"
                              - "dex.config"    = <<-EOT
                                    connectors:
                                      - type: google
                                        id: google
                                        name: Google
                                        config:
                                          clientID: $argocd-secrets:dex.google.clientId
                                          clientSecret: $argocd-secrets:dex.google.clientSecret
                                          redirectURI: https://argocd.ggorockee.com/api/dex/callback
                                          hostedDomains:
                                            - gmail.com
                                EOT
                              - "policy.csv"    = <<-EOT
                                    g, woohaen88@gmail.com, role:admin
                                    g, woohalabs@gmail.com, role:admin
                                    g, ggorockee@gmail.com, role:admin
                                EOT
                            }
                          - params = {
                              - "server.insecure" = true
                            }
                          - secret = {
                              - argocdServerAdminPassword      = "$argocd-secrets:admin.password"
                              - argocdServerAdminPasswordMtime = "2024-01-01T00:00:00Z"
                            }
                        }
                      - dex            = {
                          - enabled = true
                        }
                      - global         = {
                          - domain = "argocd.ggorockee.com"
                        }
                      - notifications  = {
                          - enabled = false
                        }
                      - redis          = {
                          - enabled = true
                        }
                      - repoServer     = {
                          - replicas = 1
                        }
                      - server         = {
                          - extraArgs      = [
                              - "--insecure",
                            ]
                          - service        = {
                              - type = "ClusterIP"
                            }
                          - serviceAccount = {
                              - annotations = {
                                  - "iam.gke.io/gcp-service-account" = "argocd-prod@infra-480802.iam.gserviceaccount.com"
                                }
                              - create      = true
                              - name        = "argocd-server"
                            }
                        }
                    }
                )
              - version        = "9.1.7"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          - <<-EOT
                global:
                  domain: argocd.ggorockee.com
                
                configs:
                  params:
                    server.insecure: true
                
                  cm:
                    # Dex configuration for Google OAuth
                    dex.config: |
                      connectors:
                        - type: google
                          id: google
                          name: Google
                          config:
                            clientID: $argocd-secrets:dex.google.clientId
                            clientSecret: $argocd-secrets:dex.google.clientSecret
                            redirectURI: https://argocd.ggorockee.com/api/dex/callback
                            hostedDomains:
                              - gmail.com
                
                    # RBAC policy
                    policy.csv: |
                      g, woohaen88@gmail.com, role:admin
                      g, woohalabs@gmail.com, role:admin
                      g, ggorockee@gmail.com, role:admin
                
                    # Admin enabled
                    admin.enabled: "true"
                
                  secret:
                    # Admin password from external secret
                    argocdServerAdminPassword: $argocd-secrets:admin.password
                    argocdServerAdminPasswordMtime: "2024-01-01T00:00:00Z"
                
                server:
                  service:
                    type: ClusterIP  # Changed from LoadBalancer to integrate with Istio Ingress Gateway
                
                  extraArgs:
                    - --insecure  # TLS termination handled by Istio Gateway
                
                  # Workload Identity annotation
                  serviceAccount:
                    create: true
                    name: argocd-server
                    annotations:
                      iam.gke.io/gcp-service-account: argocd-prod@infra-480802.iam.gserviceaccount.com
                
                repoServer:
                  replicas: 1
                
                applicationSet:
                  enabled: true
                  replicas: 1
                
                notifications:
                  enabled: false
                
                dex:
                  enabled: true
                
                redis:
                  enabled: true
            EOT,
          + <<-EOT
                global:
                  domain: argocd.ggorockee.com
                
                configs:
                  params:
                    server.insecure: true
                
                  cm:
                    # Dex configuration for Google OAuth
                    dex.config: |
                      connectors:
                        - type: google
                          id: google
                          name: Google
                          config:
                            clientID: $argocd-secrets:dex.google.clientId
                            clientSecret: $argocd-secrets:dex.google.clientSecret
                            redirectURI: https://argocd.ggorockee.com/api/dex/callback
                            hostedDomains:
                              - gmail.com
                
                    # RBAC policy
                    policy.csv: |
                      g, woohaen88@gmail.com, role:admin
                      g, woohalabs@gmail.com, role:admin
                      g, ggorockee@gmail.com, role:admin
                
                    # Admin enabled
                    admin.enabled: "true"
                
                  secret:
                    # Helm이 argocd-secret을 생성하지 않도록 설정
                    # 대신 별도로 생성한 Secret 사용 (admin-password-secret.tf 참조)
                    createSecret: false
                
                server:
                  service:
                    type: ClusterIP  # Changed from LoadBalancer to integrate with Istio Ingress Gateway
                
                  extraArgs:
                    - --insecure  # TLS termination handled by Istio Gateway
                
                  # Workload Identity annotation
                  serviceAccount:
                    create: true
                    name: argocd-server
                    annotations:
                      iam.gke.io/gcp-service-account: argocd-prod@infra-480802.iam.gserviceaccount.com
                
                repoServer:
                  replicas: 1
                
                applicationSet:
                  enabled: true
                  replicas: 1
                
                notifications:
                  enabled: false
                
                dex:
                  enabled: true
                
                redis:
                  enabled: true
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.argocd.kubernetes_manifest.argocd_init_password will be created
  + resource "kubernetes_manifest" "argocd_init_password" {
      + manifest = {
          + apiVersion = "batch/v1"
          + kind       = "Job"
          + metadata   = {
              + name      = "argocd-init-admin-password"
              + namespace = "argocd"
            }
          + spec       = {
              + template                = {
                  + spec = {
                      + containers         = [
                          + {
                              + command      = [
                                  + "sh",
                                  + "-c",
                                  + <<-EOT
                                        #!/bin/sh
                                        set -e
                                        
                                        # bcrypt 설치
                                        pip install bcrypt --quiet
                                        
                                        # argocd-secrets에서 평문 비밀번호 읽기
                                        PASSWORD=$(cat /mnt/argocd-secrets/admin.password)
                                        
                                        # bcrypt 해시 생성
                                        HASHED=$(python3 -c "import bcrypt; print(bcrypt.hashpw('$PASSWORD'.encode(), bcrypt.gensalt(rounds=10)).decode())")
                                        
                                        # base64 인코딩
                                        HASHED_B64=$(echo -n "$HASHED" | base64 -w0)
                                        
                                        # Kubernetes API를 통해 argocd-secret 패치
                                        cat <<EOF > /tmp/patch.json
                                        {
                                          "data": {
                                            "admin.password": "$HASHED_B64",
                                            "admin.passwordMtime": "$(date -u +%Y-%m-%dT%H:%M:%SZ | base64 -w0)"
                                          }
                                        }
                                        EOF
                                        
                                        # kubectl 설치
                                        apt-get update && apt-get install -y curl --quiet
                                        curl -LO "https://dl.k8s.io/release/$(curl -L -s https://dl.k8s.io/release/stable.txt)/bin/linux/amd64/kubectl"
                                        chmod +x kubectl
                                        mv kubectl /usr/local/bin/
                                        
                                        # Secret 패치
                                        kubectl patch secret argocd-secret -n argocd --type=merge --patch-file=/tmp/patch.json
                                        
                                        echo "Admin password initialized successfully"
                                    EOT,
                                ]
                              + image        = "python:3.11-slim"
                              + name         = "init-password"
                              + volumeMounts = [
                                  + {
                                      + mountPath = "/mnt/argocd-secrets"
                                      + name      = "argocd-secrets"
                                      + readOnly  = true
                                    },
                                ]
                            },
                        ]
                      + restartPolicy      = "Never"
                      + serviceAccountName = "argocd-init-password"
                      + volumes            = [
                          + {
                              + name   = "argocd-secrets"
                              + secret = {
                                  + secretName = "argocd-secrets"
                                }
                            },
                        ]
                    }
                }
              + ttlSecondsAfterFinished = 3600
            }
        }
      + object   = {
          + apiVersion = "batch/v1"
          + kind       = "Job"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-init-admin-password"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + activeDeadlineSeconds   = (known after apply)
              + backoffLimit            = (known after apply)
              + backoffLimitPerIndex    = (known after apply)
              + completionMode          = (known after apply)
              + completions             = (known after apply)
              + managedBy               = (known after apply)
              + manualSelector          = (known after apply)
              + maxFailedIndexes        = (known after apply)
              + parallelism             = (known after apply)
              + podFailurePolicy        = {
                  + rules = (known after apply)
                }
              + podReplacementPolicy    = (known after apply)
              + selector                = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = (known after apply)
                }
              + successPolicy           = {
                  + rules = (known after apply)
                }
              + suspend                 = (known after apply)
              + template                = {
                  + metadata = {
                      + annotations                = (known after apply)
                      + creationTimestamp          = (known after apply)
                      + deletionGracePeriodSeconds = (known after apply)
                      + deletionTimestamp          = (known after apply)
                      + finalizers                 = (known after apply)
                      + generateName               = (known after apply)
                      + generation                 = (known after apply)
                      + labels                     = (known after apply)
                      + managedFields              = (known after apply)
                      + name                       = (known after apply)
                      + namespace                  = (known after apply)
                      + ownerReferences            = (known after apply)
                      + resourceVersion            = (known after apply)
                      + selfLink                   = (known after apply)
                      + uid                        = (known after apply)
                    }
                  + spec     = {
                      + activeDeadlineSeconds         = (known after apply)
                      + affinity                      = {
                          + nodeAffinity    = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = {
                                  + nodeSelectorTerms = (known after apply)
                                }
                            }
                          + podAffinity     = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                          + podAntiAffinity = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
                      + automountServiceAccountToken  = (known after apply)
                      + containers                    = [
                          + {
                              + args                     = (known after apply)
                              + command                  = [
                                  + "sh",
                                  + "-c",
                                  + <<-EOT
                                        #!/bin/sh
                                        set -e
                                        
                                        # bcrypt 설치
                                        pip install bcrypt --quiet
                                        
                                        # argocd-secrets에서 평문 비밀번호 읽기
                                        PASSWORD=$(cat /mnt/argocd-secrets/admin.password)
                                        
                                        # bcrypt 해시 생성
                                        HASHED=$(python3 -c "import bcrypt; print(bcrypt.hashpw('$PASSWORD'.encode(), bcrypt.gensalt(rounds=10)).decode())")
                                        
                                        # base64 인코딩
                                        HASHED_B64=$(echo -n "$HASHED" | base64 -w0)
                                        
                                        # Kubernetes API를 통해 argocd-secret 패치
                                        cat <<EOF > /tmp/patch.json
                                        {
                                          "data": {
                                            "admin.password": "$HASHED_B64",
                                            "admin.passwordMtime": "$(date -u +%Y-%m-%dT%H:%M:%SZ | base64 -w0)"
                                          }
                                        }
                                        EOF
                                        
                                        # kubectl 설치
                                        apt-get update && apt-get install -y curl --quiet
                                        curl -LO "https://dl.k8s.io/release/$(curl -L -s https://dl.k8s.io/release/stable.txt)/bin/linux/amd64/kubectl"
                                        chmod +x kubectl
                                        mv kubectl /usr/local/bin/
                                        
                                        # Secret 패치
                                        kubectl patch secret argocd-secret -n argocd --type=merge --patch-file=/tmp/patch.json
                                        
                                        echo "Admin password initialized successfully"
                                    EOT,
                                ]
                              + env                      = (known after apply)
                              + envFrom                  = (known after apply)
                              + image                    = "python:3.11-slim"
                              + imagePullPolicy          = (known after apply)
                              + lifecycle                = {
                                  + postStart  = {
                                      + exec      = {
                                          + command = (known after apply)
                                        }
                                      + httpGet   = {
                                          + host        = (known after apply)
                                          + httpHeaders = (known after apply)
                                          + path        = (known after apply)
                                          + port        = (known after apply)
                                          + scheme      = (known after apply)
                                        }
                                      + sleep     = {
                                          + seconds = (known after apply)
                                        }
                                      + tcpSocket = {
                                          + host = (known after apply)
                                          + port = (known after apply)
                                        }
                                    }
                                  + preStop    = {
                                      + exec      = {
                                          + command = (known after apply)
                                        }
                                      + httpGet   = {
                                          + host        = (known after apply)
                                          + httpHeaders = (known after apply)
                                          + path        = (known after apply)
                                          + port        = (known after apply)
                                          + scheme      = (known after apply)
                                        }
                                      + sleep     = {
                                          + seconds = (known after apply)
                                        }
                                      + tcpSocket = {
                                          + host = (known after apply)
                                          + port = (known after apply)
                                        }
                                    }
                                  + stopSignal = (known after apply)
                                }
                              + livenessProbe            = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + name                     = "init-password"
                              + ports                    = (known after apply)
                              + readinessProbe           = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + resizePolicy             = (known after apply)
                              + resources                = {
                                  + claims   = (known after apply)
                                  + limits   = (known after apply)
                                  + requests = (known after apply)
                                }
                              + restartPolicy            = (known after apply)
                              + securityContext          = {
                                  + allowPrivilegeEscalation = (known after apply)
                                  + appArmorProfile          = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + capabilities             = {
                                      + add  = (known after apply)
                                      + drop = (known after apply)
                                    }
                                  + privileged               = (known after apply)
                                  + procMount                = (known after apply)
                                  + readOnlyRootFilesystem   = (known after apply)
                                  + runAsGroup               = (known after apply)
                                  + runAsNonRoot             = (known after apply)
                                  + runAsUser                = (known after apply)
                                  + seLinuxOptions           = {
                                      + level = (known after apply)
                                      + role  = (known after apply)
                                      + type  = (known after apply)
                                      + user  = (known after apply)
                                    }
                                  + seccompProfile           = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + windowsOptions           = {
                                      + gmsaCredentialSpec     = (known after apply)
                                      + gmsaCredentialSpecName = (known after apply)
                                      + hostProcess            = (known after apply)
                                      + runAsUserName          = (known after apply)
                                    }
                                }
                              + startupProbe             = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + stdin                    = (known after apply)
                              + stdinOnce                = (known after apply)
                              + terminationMessagePath   = (known after apply)
                              + terminationMessagePolicy = (known after apply)
                              + tty                      = (known after apply)
                              + volumeDevices            = (known after apply)
                              + volumeMounts             = [
                                  + {
                                      + mountPath         = "/mnt/argocd-secrets"
                                      + mountPropagation  = (known after apply)
                                      + name              = "argocd-secrets"
                                      + readOnly          = true
                                      + recursiveReadOnly = (known after apply)
                                      + subPath           = (known after apply)
                                      + subPathExpr       = (known after apply)
                                    },
                                ]
                              + workingDir               = (known after apply)
                            },
                        ]
                      + dnsConfig                     = {
                          + nameservers = (known after apply)
                          + options     = (known after apply)
                          + searches    = (known after apply)
                        }
                      + dnsPolicy                     = (known after apply)
                      + enableServiceLinks            = (known after apply)
                      + ephemeralContainers           = (known after apply)
                      + hostAliases                   = (known after apply)
                      + hostIPC                       = (known after apply)
                      + hostNetwork                   = (known after apply)
                      + hostPID                       = (known after apply)
                      + hostUsers                     = (known after apply)
                      + hostname                      = (known after apply)
                      + imagePullSecrets              = (known after apply)
                      + initContainers                = (known after apply)
                      + nodeName                      = (known after apply)
                      + nodeSelector                  = (known after apply)
                      + os                            = {
                          + name = (known after apply)
                        }
                      + overhead                      = (known after apply)
                      + preemptionPolicy              = (known after apply)
                      + priority                      = (known after apply)
                      + priorityClassName             = (known after apply)
                      + readinessGates                = (known after apply)
                      + resourceClaims                = (known after apply)
                      + resources                     = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                      + restartPolicy                 = "Never"
                      + runtimeClassName              = (known after apply)
                      + schedulerName                 = (known after apply)
                      + schedulingGates               = (known after apply)
                      + securityContext               = {
                          + appArmorProfile          = {
                              + localhostProfile = (known after apply)
                              + type             = (known after apply)
                            }
                          + fsGroup                  = (known after apply)
                          + fsGroupChangePolicy      = (known after apply)
                          + runAsGroup               = (known after apply)
                          + runAsNonRoot             = (known after apply)
                          + runAsUser                = (known after apply)
                          + seLinuxChangePolicy      = (known after apply)
                          + seLinuxOptions           = {
                              + level = (known after apply)
                              + role  = (known after apply)
                              + type  = (known after apply)
                              + user  = (known after apply)
                            }
                          + seccompProfile           = {
                              + localhostProfile = (known after apply)
                              + type             = (known after apply)
                            }
                          + supplementalGroups       = (known after apply)
                          + supplementalGroupsPolicy = (known after apply)
                          + sysctls                  = (known after apply)
                          + windowsOptions           = {
                              + gmsaCredentialSpec     = (known after apply)
                              + gmsaCredentialSpecName = (known after apply)
                              + hostProcess            = (known after apply)
                              + runAsUserName          = (known after apply)
                            }
                        }
                      + serviceAccount                = (known after apply)
                      + serviceAccountName            = "argocd-init-password"
                      + setHostnameAsFQDN             = (known after apply)
                      + shareProcessNamespace         = (known after apply)
                      + subdomain                     = (known after apply)
                      + terminationGracePeriodSeconds = (known after apply)
                      + tolerations                   = (known after apply)
                      + topologySpreadConstraints     = (known after apply)
                      + volumes                       = [
                          + {
                              + awsElasticBlockStore  = {
                                  + fsType    = (known after apply)
                                  + partition = (known after apply)
                                  + readOnly  = (known after apply)
                                  + volumeID  = (known after apply)
                                }
                              + azureDisk             = {
                                  + cachingMode = (known after apply)
                                  + diskName    = (known after apply)
                                  + diskURI     = (known after apply)
                                  + fsType      = (known after apply)
                                  + kind        = (known after apply)
                                  + readOnly    = (known after apply)
                                }
                              + azureFile             = {
                                  + readOnly   = (known after apply)
                                  + secretName = (known after apply)
                                  + shareName  = (known after apply)
                                }
                              + cephfs                = {
                                  + monitors   = (known after apply)
                                  + path       = (known after apply)
                                  + readOnly   = (known after apply)
                                  + secretFile = (known after apply)
                                  + secretRef  = {
                                      + name = (known after apply)
                                    }
                                  + user       = (known after apply)
                                }
                              + cinder                = {
                                  + fsType    = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                  + volumeID  = (known after apply)
                                }
                              + configMap             = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                  + name        = (known after apply)
                                  + optional    = (known after apply)
                                }
                              + csi                   = {
                                  + driver               = (known after apply)
                                  + fsType               = (known after apply)
                                  + nodePublishSecretRef = {
                                      + name = (known after apply)
                                    }
                                  + readOnly             = (known after apply)
                                  + volumeAttributes     = (known after apply)
                                }
                              + downwardAPI           = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                }
                              + emptyDir              = {
                                  + medium    = (known after apply)
                                  + sizeLimit = (known after apply)
                                }
                              + ephemeral             = {
                                  + volumeClaimTemplate = {
                                      + metadata = {
                                          + annotations                = (known after apply)
                                          + creationTimestamp          = (known after apply)
                                          + deletionGracePeriodSeconds = (known after apply)
                                          + deletionTimestamp          = (known after apply)
                                          + finalizers                 = (known after apply)
                                          + generateName               = (known after apply)
                                          + generation                 = (known after apply)
                                          + labels                     = (known after apply)
                                          + managedFields              = (known after apply)
                                          + name                       = (known after apply)
                                          + namespace                  = (known after apply)
                                          + ownerReferences            = (known after apply)
                                          + resourceVersion            = (known after apply)
                                          + selfLink                   = (known after apply)
                                          + uid                        = (known after apply)
                                        }
                                      + spec     = {
                                          + accessModes               = (known after apply)
                                          + dataSource                = {
                                              + apiGroup = (known after apply)
                                              + kind     = (known after apply)
                                              + name     = (known after apply)
                                            }
                                          + dataSourceRef             = {
                                              + apiGroup  = (known after apply)
                                              + kind      = (known after apply)
                                              + name      = (known after apply)
                                              + namespace = (known after apply)
                                            }
                                          + resources                 = {
                                              + limits   = (known after apply)
                                              + requests = (known after apply)
                                            }
                                          + selector                  = {
                                              + matchExpressions = (known after apply)
                                              + matchLabels      = (known after apply)
                                            }
                                          + storageClassName          = (known after apply)
                                          + volumeAttributesClassName = (known after apply)
                                          + volumeMode                = (known after apply)
                                          + volumeName                = (known after apply)
                                        }
                                    }
                                }
                              + fc                    = {
                                  + fsType     = (known after apply)
                                  + lun        = (known after apply)
                                  + readOnly   = (known after apply)
                                  + targetWWNs = (known after apply)
                                  + wwids      = (known after apply)
                                }
                              + flexVolume            = {
                                  + driver    = (known after apply)
                                  + fsType    = (known after apply)
                                  + options   = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                }
                              + flocker               = {
                                  + datasetName = (known after apply)
                                  + datasetUUID = (known after apply)
                                }
                              + gcePersistentDisk     = {
                                  + fsType    = (known after apply)
                                  + partition = (known after apply)
                                  + pdName    = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + gitRepo               = {
                                  + directory  = (known after apply)
                                  + repository = (known after apply)
                                  + revision   = (known after apply)
                                }
                              + glusterfs             = {
                                  + endpoints = (known after apply)
                                  + path      = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + hostPath              = {
                                  + path = (known after apply)
                                  + type = (known after apply)
                                }
                              + image                 = {
                                  + pullPolicy = (known after apply)
                                  + reference  = (known after apply)
                                }
                              + iscsi                 = {
                                  + chapAuthDiscovery = (known after apply)
                                  + chapAuthSession   = (known after apply)
                                  + fsType            = (known after apply)
                                  + initiatorName     = (known after apply)
                                  + iqn               = (known after apply)
                                  + iscsiInterface    = (known after apply)
                                  + lun               = (known after apply)
                                  + portals           = (known after apply)
                                  + readOnly          = (known after apply)
                                  + secretRef         = {
                                      + name = (known after apply)
                                    }
                                  + targetPortal      = (known after apply)
                                }
                              + name                  = "argocd-secrets"
                              + nfs                   = {
                                  + path     = (known after apply)
                                  + readOnly = (known after apply)
                                  + server   = (known after apply)
                                }
                              + persistentVolumeClaim = {
                                  + claimName = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + photonPersistentDisk  = {
                                  + fsType = (known after apply)
                                  + pdID   = (known after apply)
                                }
                              + portworxVolume        = {
                                  + fsType   = (known after apply)
                                  + readOnly = (known after apply)
                                  + volumeID = (known after apply)
                                }
                              + projected             = {
                                  + defaultMode = (known after apply)
                                  + sources     = (known after apply)
                                }
                              + quobyte               = {
                                  + group    = (known after apply)
                                  + readOnly = (known after apply)
                                  + registry = (known after apply)
                                  + tenant   = (known after apply)
                                  + user     = (known after apply)
                                  + volume   = (known after apply)
                                }
                              + rbd                   = {
                                  + fsType    = (known after apply)
                                  + image     = (known after apply)
                                  + keyring   = (known after apply)
                                  + monitors  = (known after apply)
                                  + pool      = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                  + user      = (known after apply)
                                }
                              + scaleIO               = {
                                  + fsType           = (known after apply)
                                  + gateway          = (known after apply)
                                  + protectionDomain = (known after apply)
                                  + readOnly         = (known after apply)
                                  + secretRef        = {
                                      + name = (known after apply)
                                    }
                                  + sslEnabled       = (known after apply)
                                  + storageMode      = (known after apply)
                                  + storagePool      = (known after apply)
                                  + system           = (known after apply)
                                  + volumeName       = (known after apply)
                                }
                              + secret                = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                  + optional    = (known after apply)
                                  + secretName  = "argocd-secrets"
                                }
                              + storageos             = {
                                  + fsType          = (known after apply)
                                  + readOnly        = (known after apply)
                                  + secretRef       = {
                                      + name = (known after apply)
                                    }
                                  + volumeName      = (known after apply)
                                  + volumeNamespace = (known after apply)
                                }
                              + vsphereVolume         = {
                                  + fsType            = (known after apply)
                                  + storagePolicyID   = (known after apply)
                                  + storagePolicyName = (known after apply)
                                  + volumePath        = (known after apply)
                                }
                            },
                        ]
                    }
                }
              + ttlSecondsAfterFinished = 3600
            }
        }
    }

  # module.argocd.kubernetes_role.argocd_init_password will be created
  + resource "kubernetes_role" "argocd_init_password" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "secrets",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "patch",
              + "update",
            ]
        }
    }

  # module.argocd.kubernetes_role_binding.argocd_init_password will be created
  + resource "kubernetes_role_binding" "argocd_init_password" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "argocd-init-password"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "argocd-init-password"
          + namespace = "argocd"
        }
    }

  # module.argocd.kubernetes_secret.argocd_secret will be created
  + resource "kubernetes_secret" "argocd_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name"    = "argocd-secret"
              + "app.kubernetes.io/part-of" = "argocd"
            }
          + name             = "argocd-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_service_account.argocd_init_password will be created
  + resource "kubernetes_service_account" "argocd_init_password" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

```

</details>

---

**To apply this plan, comment:**
- `apply` or `ok` or `terraform apply`

*Pusher: @ggorockee, Action: `pull_request`, Workflow: `GCP Terraform Plan`*